[Killed] BlockStatement
src/auth/guards/roles.guard.ts:11:51
 export class RolesGuard implements CanActivate {
   constructor(private reflector: Reflector) {}
 
-  canActivate(context: ExecutionContext): boolean {
-    const requiredRoles = this.reflector.getAllAndOverride<UserRole[]>(
-      'roles',
-      [context.getHandler(), context.getClass()],
-    );
-
-    if (!requiredRoles) {
-      return true; // No roles specified, allow access
-    }
-
-    const { user } = context.switchToHttp().getRequest();
-
-    console.log('RolesGuard - User object:', user);
-    console.log('RolesGuard - User role:', user?.role);
-
-    if (!user || !user.role) {
-      console.log('RolesGuard - User or role is undefined, denying access');
-      return false;
-    }
-
-    return requiredRoles.some((role) => user.role === role);
-  }
+  canActivate(context: ExecutionContext): boolean {}
 }
 
killedBy: RolesGuard canActivate should return true when no roles are required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] OptionalChaining
src/auth/guards/roles.guard.ts:24:44
     const { user } = context.switchToHttp().getRequest();
 
     console.log('RolesGuard - User object:', user);
-    console.log('RolesGuard - User role:', user?.role);
+    console.log('RolesGuard - User role:', user.role);
 
     if (!user || !user.role) {

[Survived] StringLiteral
src/auth/guards/roles.guard.ts:24:17
     const { user } = context.switchToHttp().getRequest();
 
     console.log('RolesGuard - User object:', user);
-    console.log('RolesGuard - User role:', user?.role);
+    console.log("", user?.role);
 
     if (!user || !user.role) {

[Killed] ConditionalExpression
src/auth/guards/roles.guard.ts:26:9
     console.log('RolesGuard - User object:', user);
     console.log('RolesGuard - User role:', user?.role);
 
-    if (!user || !user.role) {
+    if (true) {
       console.log('RolesGuard - User or role is undefined, denying access');
       return false;
killedBy: RolesGuard canActivate should return true when user has required role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/auth/guards/roles.guard.ts:26:9
     console.log('RolesGuard - User object:', user);
     console.log('RolesGuard - User role:', user?.role);
 
-    if (!user || !user.role) {
+    if (user || !user.role) {
       console.log('RolesGuard - User or role is undefined, denying access');
       return false;
killedBy: RolesGuard canActivate should return true when user has required role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/auth/guards/roles.guard.ts:27:19
     console.log('RolesGuard - User role:', user?.role);
 
     if (!user || !user.role) {
-      console.log('RolesGuard - User or role is undefined, denying access');
+      console.log("");
       return false;
     }

[Survived] BooleanLiteral
src/auth/guards/roles.guard.ts:28:14
 
     if (!user || !user.role) {
       console.log('RolesGuard - User or role is undefined, denying access');
-      return false;
+      return true;
     }
 

[Killed] ConditionalExpression
src/auth/guards/roles.guard.ts:31:41
       return false;
     }
 
-    return requiredRoles.some((role) => user.role === role);
+    return requiredRoles.some((role) => true);
   }
 }
killedBy: RolesGuard canActivate should return false when user does not have required role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
