[Killed] BlockStatement
src/users/services/user-facade.service.ts:67:9
     }
 
     // Create welcome notification (optional, don't fail if it fails)
-    try {
-      await this.notificationService.createNotification({
-        userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
-        type: 'info',
-        link: '/dashboard',
-      });
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
killedBy: UserFacadeService - Mutant Killer Tests Notification Error Handling Tests should test create method notification error handling
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:68:57
 
     // Create welcome notification (optional, don't fail if it fails)
     try {
-      await this.notificationService.createNotification({
-        userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
-        type: 'info',
-        link: '/dashboard',
-      });
+      await this.notificationService.createNotification({});
     } catch (error) {
       const errorMessage =
killedBy: UserFacadeService - Comprehensive Mutation Tests (Fixed) create - Comprehensive Tests should test notification creation with all fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",

[Killed] LogicalOperator
src/users/services/user-facade.service.ts:70:40
     try {
       await this.notificationService.createNotification({
         userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
+        message: `Welcome to Alkitu, ${user.name && user.email}!`,
         type: 'info',
         link: '/dashboard',
killedBy: UserFacadeService - Comprehensive Mutation Tests (Fixed) create - Comprehensive Tests should test notification creation with all fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:107:58
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async update(id: string, updateUserDto: UpdateUserDto) {
-    // Get previous data for events
-    const previousUser = await this.userRepository.findById(id);
-
-    // Update user
-    const updatedUser = await this.userRepository.update(id, updateUserDto);
-
-    // Get full user data for events
-    const fullUser = await this.userRepository.findByEmail(updatedUser.email);
-    if (fullUser && previousUser) {
-      // Publish user updated event - convert UserResponse to User for events
-      await this.userEvents.publishUserUpdated(fullUser, {
-        id: previousUser.id,
-        email: previousUser.email,
-        name: previousUser.name,
-        lastName: previousUser.lastName,
-        contactNumber: previousUser.contactNumber,
-      });
-    }
-
-    return updatedUser;
-  }
+  async update(id: string, updateUserDto: UpdateUserDto) {}
 
   // ✅ SRP: Delegates to UserRepositoryService
killedBy: UserFacadeService Mutation Tests update should update user successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"contactNumber": "+1234567890", "createdAt": 2025-07-12T00:36:43.907Z, "email": "test@example.com", "id": "1", "lastLogin": 2025-07-12T00:36:43.907Z, "lastName": "Updated LastName", "name": "Updated Name", "role": "user"}
Received: undefined

[Killed] LogicalOperator
src/users/services/user-facade.service.ts:116:9
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(updatedUser.email);
-    if (fullUser && previousUser) {
+    if (fullUser || previousUser) {
       // Publish user updated event - convert UserResponse to User for events
       await this.userEvents.publishUserUpdated(fullUser, {
killedBy: UserFacadeService - Comprehensive Mutation Tests (Fixed) create - Comprehensive Tests should test bulk role update with proper enums
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:116:35
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(updatedUser.email);
-    if (fullUser && previousUser) {
-      // Publish user updated event - convert UserResponse to User for events
-      await this.userEvents.publishUserUpdated(fullUser, {
-        id: previousUser.id,
-        email: previousUser.email,
-        name: previousUser.name,
-        lastName: previousUser.lastName,
-        contactNumber: previousUser.contactNumber,
-      });
-    }
+    if (fullUser && previousUser) {}
 
     return updatedUser;
killedBy: UserFacadeService Mutation Tests update should update user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:136:28
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async remove(id: string) {
-    // Get user data before deletion for events
-    const user = await this.userRepository.findById(id);
-
-    // Check if user exists
-    if (!user) {
-      throw new Error('User not found');
-    }
-
-    // Delete user
-    await this.userRepository.delete(id);
-
-    // Publish user deleted event
-    await this.userEvents.publishUserDeleted(id, {
-      id: user.id,
-      email: user.email,
-      name: user.name,
-      lastName: user.lastName,
-      contactNumber: user.contactNumber,
-    });
-
-    // Return success message for backward compatibility
-    return { message: 'User deleted successfully' };
-  }
+  async remove(id: string) {}
 
   // ✅ SRP: Delegates to UserAuthenticationService + UserEventsService
killedBy: UserFacadeService Mutation Tests remove should remove user successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "User deleted successfully"}
Received: undefined

[Killed] BlockStatement
src/users/services/user-facade.service.ts:141:16
     const user = await this.userRepository.findById(id);
 
     // Check if user exists
-    if (!user) {
-      throw new Error('User not found');
-    }
+    if (!user) {}
 
     // Delete user
killedBy: UserFacadeService - 100% Mutation Coverage Surviving Mutant #2: If (!user) Block in Update Method (Line 141) should throw error when user is not found in remove method
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "User not found"
Received message:   "Cannot read properties of null (reading 'id')"

      243 |       // Publish user deleted event
      244 |       await this.userEvents.publishUserDeleted(id, stryMutAct_9fa48("33") ? {} : (stryCov_9fa48("33"), {
    > 245 |         id: user.id,

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:149:50
     await this.userRepository.delete(id);
 
     // Publish user deleted event
-    await this.userEvents.publishUserDeleted(id, {
-      id: user.id,
-      email: user.email,
-      name: user.name,
-      lastName: user.lastName,
-      contactNumber: user.contactNumber,
-    });
+    await this.userEvents.publishUserDeleted(id, {});
 
     // Return success message for backward compatibility
killedBy: UserFacadeService Mutation Tests remove should remove user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "1",
- Object {
-   "contactNumber": "+1234567890",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:166:28
     const authenticatedUser =
       await this.userAuthentication.validateUser(loginDto);
 
-    if (authenticatedUser) {
-      // Publish login event
-      await this.userEvents.publishUserLoggedIn(authenticatedUser.id);
-    }
+    if (authenticatedUser) {}
 
     return authenticatedUser;
killedBy: UserFacadeService - Mutant Killer Tests Conditional Logic Tests should test if (authenticatedUser) condition in validateUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "507f1f77bcf86cd799439011"

Number of calls: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:215:39
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async anonymizeUser(userId: string) {
-    const anonymizedData = {
-      name: 'Anonymous User',
-      lastName: 'Anonymous',
-      email: `anonymous_${userId}@example.com`,
-      contactNumber: undefined, // Use undefined instead of null for UpdateUserDto
-    };
-
-    const user = await this.userRepository.update(userId, anonymizedData);
-
-    // Publish user updated event
-    const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
-      await this.userEvents.publishUserUpdated(fullUser, { id: userId });
-    }
-
-    return {
-      success: true,
-      userId,
-      anonymizedFields: Object.keys(anonymizedData),
-      retainedFields: ['id', 'role', 'createdAt'],
-      timestamp: new Date(),
-    };
-  }
+  async anonymizeUser(userId: string) {}
 
   // ✅ SRP: Delegates to NotificationService
killedBy: UserFacadeService - Mutant Killer Tests Uncovered Methods Tests should test anonymizeUser method execution and verify object literals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user-id", {"contactNumber": undefined, "email": "anonymous_user-id@example.com", "lastName": "Anonymous", "name": "Anonymous User"}

Number of calls: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:227:19
 
     // Publish user updated event
     const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
-      await this.userEvents.publishUserUpdated(fullUser, { id: userId });
-    }
+    if (fullUser) {}
 
     return {
killedBy: UserFacadeService - Mutant Killer Tests Uncovered Methods Tests should test anonymizeUser method execution and verify object literals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ArrayDeclaration
src/users/services/user-facade.service.ts:235:23
       success: true,
       userId,
       anonymizedFields: Object.keys(anonymizedData),
-      retainedFields: ['id', 'role', 'createdAt'],
+      retainedFields: [],
       timestamp: new Date(),
     };
killedBy: UserFacadeService - Mutant Killer Tests Uncovered Methods Tests should test anonymizeUser method execution and verify object literals
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -3,14 +3,10 @@
      "name",
      "lastName",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:241:60
   }
 
   // ✅ SRP: Delegates to NotificationService
-  async sendMessageToUser(userId: string, message: string) {
-    try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: 'info',
-      });
-      return { success: true, message: 'Message sent successfully' };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : 'Unknown error';
-      return {
-        success: false,
-        message: `Failed to send message: ${errorMessage}`,
-      };
-    }
-  }
+  async sendMessageToUser(userId: string, message: string) {}
 
   // ✅ SRP: Delegates to UserAuthenticationService
killedBy: UserFacadeService - Mutant Killer Tests Notification Error Handling Tests should test sendMessageToUser success path and object literals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": "Test message", "type": "info", "userId": "user-id"}

Number of calls: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:242:9
 
   // ✅ SRP: Delegates to NotificationService
   async sendMessageToUser(userId: string, message: string) {
-    try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: 'info',
-      });
-      return { success: true, message: 'Message sent successfully' };
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
killedBy: UserFacadeService - Mutant Killer Tests Notification Error Handling Tests should test sendMessageToUser success path and object literals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": "Test message", "type": "info", "userId": "user-id"}

Number of calls: 0

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:243:57
   // ✅ SRP: Delegates to NotificationService
   async sendMessageToUser(userId: string, message: string) {
     try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: 'info',
-      });
+      await this.notificationService.createNotification({});
       return { success: true, message: 'Message sent successfully' };
     } catch (error) {
killedBy: UserFacadeService - Mutant Killer Tests Notification Error Handling Tests should test sendMessageToUser success path and object literals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Test message",
-   "type": "info",

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:296:12
       successCount: deletedCount,
     });
 
-    return {
-      success: true,
-      message: `Successfully deleted ${deletedCount} out of ${userIds.length} users`,
-      affectedCount: deletedCount,
-    };
+    return {};
   }
 
killedBy: UserFacadeService - 100% Mutation Coverage Surviving Mutant #3: Catch Block in BulkDeleteUsers (Line 285) should execute catch block when individual delete fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:358:12
       },
     );
 
-    return {
-      success: true,
-      message: `Successfully updated status for ${updatedCount} out of ${userIds.length} users`,
-      affectedCount: updatedCount,
-    };
+    return {};
   }
 
killedBy: UserFacadeService - Mutant Killer Tests Bulk Operations Error Handling Tests should test bulkUpdateStatus with individual errors
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "affectedCount": 1,
-   "message": "Successfully updated status for 1 out of 2 users",

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:366:33
   }
 
   async resetUserPassword(resetPasswordDto: ResetPasswordDto) {
-    const { userId, sendEmail = true } = resetPasswordDto;
+    const { userId, sendEmail = false } = resetPasswordDto;
 
     // Generate temporary password
killedBy: UserFacadeService - 100% Mutation Coverage Surviving Mutant #8: Boolean Literal sendEmail = true vs false (Line 366) should test default sendEmail = true behavior
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/users/services/user-facade.service.ts:380:20
     await this.userEvents.publishUserPasswordChanged(userId);
 
     let emailSent = false;
-    if (sendEmail) {
-      try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: 'warning',
-        });
-        emailSent = true;
-      } catch (error) {
-        console.error('Failed to send password reset email:', error);
-      }
-    }
+    if (sendEmail) {}
 
     return {
killedBy: UserFacadeService - Mutant Killer Tests Password Reset Tests should test resetUserPassword with email sending enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": StringContaining "Your password has been reset", "type": "warning", "userId": "user-id"}

Number of calls: 0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:381:11
 
     let emailSent = false;
     if (sendEmail) {
-      try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: 'warning',
-        });
-        emailSent = true;
-      } catch (error) {
+      try {} catch (error) {
         console.error('Failed to send password reset email:', error);
       }
killedBy: UserFacadeService - Mutant Killer Tests Password Reset Tests should test resetUserPassword with email sending enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": StringContaining "Your password has been reset", "type": "warning", "userId": "user-id"}

Number of calls: 0

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:382:59
     let emailSent = false;
     if (sendEmail) {
       try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: 'warning',
-        });
+        await this.notificationService.createNotification({});
         emailSent = true;
       } catch (error) {
killedBy: UserFacadeService - Mutant Killer Tests Password Reset Tests should test resetUserPassword with email sending enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": StringContaining "Your password has been reset",
-   "type": "warning",
