[Killed] ConditionalExpression
src/auth/token.service.ts:112:9
       return { valid: false };
     }
 
-    if (tokenRecord.expires < new Date()) {
+    if (true) {
       // Token expirado, eliminar
       await this.prisma.verificationToken.delete({
killedBy: TokenService validateEmailVerificationToken should validate valid email verification token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "email": "test@example.com",
-   "valid": true,
