[Killed] BlockStatement
src/users/services/user-facade.service.ts:68:9
     }
 
     // Create welcome notification (optional, don't fail if it fails)
-    try {
-      await this.notificationService.createNotification({
-        userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
-        type: NotificationType.INFO,
-        link: '/dashboard',
-      });
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"link": "/dashboard", "message": "Welcome to Alkitu, Test!", "type": "info", "userId": "test-user-id"}

Number of calls: 0

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:71:40
     try {
       await this.notificationService.createNotification({
         userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
+        message: `Welcome to Alkitu, ${true}!`,
         type: NotificationType.INFO,
         link: '/dashboard',
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:71:40
     try {
       await this.notificationService.createNotification({
         userId: user.id,
-        message: `Welcome to Alkitu, ${user.name || user.email}!`,
+        message: `Welcome to Alkitu, ${false}!`,
         type: NotificationType.INFO,
         link: '/dashboard',
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",
