[Killed] BlockStatement
src/auth/guards/roles.guard.ts:11:51
 export class RolesGuard implements CanActivate {
   constructor(private reflector: Reflector) {}
 
-  canActivate(context: ExecutionContext): boolean {
-    const requiredRoles = this.reflector.getAllAndOverride<UserRole[]>(
-      'roles',
-      [context.getHandler(), context.getClass()],
-    );
-
-    if (!requiredRoles) {
-      return true; // No roles specified, allow access
-    }
-
-    const request = context.switchToHttp().getRequest();
-    const { user } = request;
-
-    if (!user || !user.role) {
-      return false;
-    }
-
-    return requiredRoles.some((role) => user.role === role);
-  }
+  canActivate(context: ExecutionContext): boolean {}
 }
 
killedBy: RolesGuard canActivate should return true when no roles are required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/auth/guards/roles.guard.ts:17:9
       [context.getHandler(), context.getClass()],
     );
 
-    if (!requiredRoles) {
+    if (requiredRoles) {
       return true; // No roles specified, allow access
     }
killedBy: RolesGuard canActivate should return true when no roles are required
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/auth/guards/roles.guard.ts:17:25
       [context.getHandler(), context.getClass()],
     );
 
-    if (!requiredRoles) {
-      return true; // No roles specified, allow access
-    }
+    if (!requiredRoles) {}
 
     const request = context.switchToHttp().getRequest();
killedBy: RolesGuard canActivate should return true when no roles are required
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] BooleanLiteral
src/auth/guards/roles.guard.ts:18:14
     );
 
     if (!requiredRoles) {
-      return true; // No roles specified, allow access
+      return false; // No roles specified, allow access
     }
 
killedBy: RolesGuard canActivate should return true when no roles are required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/auth/guards/roles.guard.ts:24:18
     const request = context.switchToHttp().getRequest();
     const { user } = request;
 
-    if (!user || !user.role) {
+    if (!user || user.role) {
       return false;
     }
killedBy: RolesGuard canActivate should return true when user has required role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/auth/guards/roles.guard.ts:24:9
     const request = context.switchToHttp().getRequest();
     const { user } = request;
 
-    if (!user || !user.role) {
+    if (false) {
       return false;
     }
killedBy: RolesGuard canActivate should return false when user is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'role')

[Killed] BooleanLiteral
src/auth/guards/roles.guard.ts:25:14
     const { user } = request;
 
     if (!user || !user.role) {
-      return false;
+      return true;
     }
 
killedBy: RolesGuard canActivate should return false when user is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/auth/guards/roles.guard.ts:28:31
       return false;
     }
 
-    return requiredRoles.some((role) => user.role === role);
+    return requiredRoles.some(() => undefined);
   }
 }
killedBy: RolesGuard canActivate should return true when user has required role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/auth/guards/roles.guard.ts:28:12
       return false;
     }
 
-    return requiredRoles.some((role) => user.role === role);
+    return requiredRoles.every(role => user.role === role);
   }
 }
killedBy: RolesGuard canActivate should return true when user has one of multiple required roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
