[Killed] BlockStatement
src/auth/token.service.ts:12:35
   /**
    * Genera un token único de 32 caracteres
    */
-  private generateToken(): string {
-    return randomBytes(32).toString('hex');
-  }
+  private generateToken(): string {}
 
   /**
killedBy: TokenService createPasswordResetToken should create password reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "email": "test@example.com",

[Survived] StringLiteral
src/auth/token.service.ts:13:37
    * Genera un token único de 32 caracteres
    */
   private generateToken(): string {
-    return randomBytes(32).toString('hex');
+    return randomBytes(32).toString("");
   }
 

[Killed] BlockStatement
src/auth/token.service.ts:19:66
   /**
    * Crea un token de reset de contraseña
    */
-  async createPasswordResetToken(email: string): Promise<string> {
-    const token = this.generateToken();
-    const expires = new Date(Date.now() + 60 * 60 * 1000); // 1 hora
-
-    // Eliminar tokens existentes para este email
-    await this.prisma.passwordResetToken.deleteMany({
-      where: { email },
-    });
-
-    // Crear nuevo token
-    await this.prisma.passwordResetToken.create({
-      data: {
-        email,
-        token,
-        expires,
-      },
-    });
-
-    return token;
-  }
+  async createPasswordResetToken(email: string): Promise<string> {}
 
   /**
killedBy: TokenService createPasswordResetToken should create password reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"email": "test@example.com"}}

Number of calls: 0

[Survived] ArithmeticOperator
src/auth/token.service.ts:21:30
    */
   async createPasswordResetToken(email: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 60 * 60 * 1000); // 1 hora
+    const expires = new Date(Date.now() - 60 * 60 * 1000); // 1 hora
 
     // Eliminar tokens existentes para este email

[Survived] ArithmeticOperator
src/auth/token.service.ts:21:43
    */
   async createPasswordResetToken(email: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 60 * 60 * 1000); // 1 hora
+    const expires = new Date(Date.now() + 60 / 60 * 1000); // 1 hora
 
     // Eliminar tokens existentes para este email

[Killed] ObjectLiteral
src/auth/token.service.ts:24:53
     const expires = new Date(Date.now() + 60 * 60 * 1000); // 1 hora
 
     // Eliminar tokens existentes para este email
-    await this.prisma.passwordResetToken.deleteMany({
-      where: { email },
-    });
+    await this.prisma.passwordResetToken.deleteMany({});
 
     // Crear nuevo token
killedBy: TokenService createPasswordResetToken should create password reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "email": "test@example.com",

[Killed] ObjectLiteral
src/auth/token.service.ts:30:13
 
     // Crear nuevo token
     await this.prisma.passwordResetToken.create({
-      data: {
-        email,
-        token,
-        expires,
-      },
+      data: {},
     });
 
killedBy: TokenService createPasswordResetToken should create password reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Object {
-     "email": "test@example.com",

[Killed] BlockStatement
src/auth/token.service.ts:45:50
    */
   async validatePasswordResetToken(
     token: string,
-  ): Promise<{ valid: boolean; email?: string }> {
-    const tokenRecord = await this.prisma.passwordResetToken.findUnique({
-      where: { token },
-    });
-
-    if (!tokenRecord) {
-      return { valid: false };
-    }
-
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.passwordResetToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
-
-    return { valid: true, email: tokenRecord.email };
-  }
+  ): Promise<{ valid: boolean; email?: string }> {}
 
   /**
killedBy: TokenService validatePasswordResetToken should validate valid token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "valid": true}
Received: undefined

[Survived] ObjectLiteral
src/auth/token.service.ts:46:73
   async validatePasswordResetToken(
     token: string,
   ): Promise<{ valid: boolean; email?: string }> {
-    const tokenRecord = await this.prisma.passwordResetToken.findUnique({
-      where: { token },
-    });
+    const tokenRecord = await this.prisma.passwordResetToken.findUnique({});
 
     if (!tokenRecord) {

[Killed] ConditionalExpression
src/auth/token.service.ts:50:9
       where: { token },
     });
 
-    if (!tokenRecord) {
+    if (false) {
       return { valid: false };
     }
killedBy: TokenService validatePasswordResetToken should return invalid for non-existent token
statusReason: TypeError: Cannot read properties of null (reading 'expires')

[Killed] BooleanLiteral
src/auth/token.service.ts:50:9
       where: { token },
     });
 
-    if (!tokenRecord) {
+    if (tokenRecord) {
       return { valid: false };
     }
killedBy: TokenService validatePasswordResetToken should validate valid token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "email": "test@example.com",
-   "valid": true,

[Killed] BooleanLiteral
src/auth/token.service.ts:51:23
     });
 
     if (!tokenRecord) {
-      return { valid: false };
+      return { valid: true };
     }
 
killedBy: TokenService validatePasswordResetToken should return invalid for non-existent token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "valid": false,
+   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:51:14
     });
 
     if (!tokenRecord) {
-      return { valid: false };
+      return {};
     }
 
killedBy: TokenService validatePasswordResetToken should return invalid for non-existent token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "valid": false,
- }

[Killed] BlockStatement
src/auth/token.service.ts:54:43
       return { valid: false };
     }
 
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.passwordResetToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
+    if (tokenRecord.expires < new Date()) {}
 
     return { valid: true, email: tokenRecord.email };
killedBy: TokenService validatePasswordResetToken should return invalid and delete expired token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "expired-token"}}

Number of calls: 0

[Killed] EqualityOperator
src/auth/token.service.ts:54:9
       return { valid: false };
     }
 
-    if (tokenRecord.expires < new Date()) {
+    if (tokenRecord.expires >= new Date()) {
       // Token expirado, eliminar
       await this.prisma.passwordResetToken.delete({
killedBy: TokenService validatePasswordResetToken should validate valid token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "email": "test@example.com",
-   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:56:51
 
     if (tokenRecord.expires < new Date()) {
       // Token expirado, eliminar
-      await this.prisma.passwordResetToken.delete({
-        where: { token },
-      });
+      await this.prisma.passwordResetToken.delete({});
       return { valid: false };
     }
killedBy: TokenService validatePasswordResetToken should return invalid and delete expired token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "token": "expired-token",

[Killed] ObjectLiteral
src/auth/token.service.ts:57:16
     if (tokenRecord.expires < new Date()) {
       // Token expirado, eliminar
       await this.prisma.passwordResetToken.delete({
-        where: { token },
+        where: {},
       });
       return { valid: false };
killedBy: TokenService validatePasswordResetToken should return invalid and delete expired token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "token": "expired-token",

[Killed] BooleanLiteral
src/auth/token.service.ts:59:23
       await this.prisma.passwordResetToken.delete({
         where: { token },
       });
-      return { valid: false };
+      return { valid: true };
     }
 
killedBy: TokenService validatePasswordResetToken should return invalid and delete expired token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "valid": false,
+   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:59:14
       await this.prisma.passwordResetToken.delete({
         where: { token },
       });
-      return { valid: false };
+      return {};
     }
 
killedBy: TokenService validatePasswordResetToken should return invalid and delete expired token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "valid": false,
- }

[Killed] BooleanLiteral
src/auth/token.service.ts:62:21
       return { valid: false };
     }
 
-    return { valid: true, email: tokenRecord.email };
+    return { valid: false, email: tokenRecord.email };
   }
 
killedBy: TokenService validatePasswordResetToken should validate valid token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "email": "test@example.com",
-   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:62:12
       return { valid: false };
     }
 
-    return { valid: true, email: tokenRecord.email };
+    return {};
   }
 
killedBy: TokenService validatePasswordResetToken should validate valid token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "email": "test@example.com",
-   "valid": true,

[Killed] BlockStatement
src/auth/token.service.ts:68:65
   /**
    * Consume un token de reset de contraseña (lo elimina)
    */
-  async consumePasswordResetToken(token: string): Promise<void> {
-    await this.prisma.passwordResetToken.delete({
-      where: { token },
-    });
-  }
+  async consumePasswordResetToken(token: string): Promise<void> {}
 
   /**
killedBy: TokenService consumePasswordResetToken should delete token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "token-to-consume"}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:69:49
    * Consume un token de reset de contraseña (lo elimina)
    */
   async consumePasswordResetToken(token: string): Promise<void> {
-    await this.prisma.passwordResetToken.delete({
-      where: { token },
-    });
+    await this.prisma.passwordResetToken.delete({});
   }
 
killedBy: TokenService consumePasswordResetToken should delete token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "token": "token-to-consume",

[Killed] BlockStatement
src/auth/token.service.ts:77:70
   /**
    * Crea un token de verificación de email
    */
-  async createEmailVerificationToken(email: string): Promise<string> {
-    const token = this.generateToken();
-    const expires = new Date(Date.now() + 24 * 60 * 60 * 1000); // 24 horas
-
-    // Eliminar tokens existentes para este email
-    await this.prisma.verificationToken.deleteMany({
-      where: { identifier: email },
-    });
-
-    // Crear nuevo token
-    await this.prisma.verificationToken.create({
-      data: {
-        identifier: email,
-        token,
-        expires,
-      },
-    });
-
-    return token;
-  }
+  async createEmailVerificationToken(email: string): Promise<string> {}
 
   /**
killedBy: TokenService createEmailVerificationToken should create email verification token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"identifier": "test@example.com"}}

Number of calls: 0

[Survived] ArithmeticOperator
src/auth/token.service.ts:79:43
    */
   async createEmailVerificationToken(email: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 24 * 60 * 60 * 1000); // 24 horas
+    const expires = new Date(Date.now() + 24 * 60 / 60 * 1000); // 24 horas
 
     // Eliminar tokens existentes para este email

[Survived] ArithmeticOperator
src/auth/token.service.ts:79:30
    */
   async createEmailVerificationToken(email: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 24 * 60 * 60 * 1000); // 24 horas
+    const expires = new Date(Date.now() - 24 * 60 * 60 * 1000); // 24 horas
 
     // Eliminar tokens existentes para este email

[Killed] ObjectLiteral
src/auth/token.service.ts:88:13
 
     // Crear nuevo token
     await this.prisma.verificationToken.create({
-      data: {
-        identifier: email,
-        token,
-        expires,
-      },
+      data: {},
     });
 
killedBy: TokenService createEmailVerificationToken should create email verification token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Object {
-     "expires": Any<Date>,

[Killed] BlockStatement
src/auth/token.service.ts:103:50
    */
   async validateEmailVerificationToken(
     token: string,
-  ): Promise<{ valid: boolean; email?: string }> {
-    const tokenRecord = await this.prisma.verificationToken.findUnique({
-      where: { token },
-    });
-
-    if (!tokenRecord) {
-      return { valid: false };
-    }
-
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.verificationToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
-
-    return { valid: true, email: tokenRecord.identifier };
-  }
+  ): Promise<{ valid: boolean; email?: string }> {}
 
   /**
killedBy: TokenService validateEmailVerificationToken should validate valid email verification token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "valid": true}
Received: undefined

[Killed] BlockStatement
src/auth/token.service.ts:108:23
       where: { token },
     });
 
-    if (!tokenRecord) {
-      return { valid: false };
-    }
+    if (!tokenRecord) {}
 
     if (tokenRecord.expires < new Date()) {
killedBy: TokenService validateEmailVerificationToken should return invalid for non-existent email verification token
statusReason: TypeError: Cannot read properties of null (reading 'expires')

[Killed] ConditionalExpression
src/auth/token.service.ts:108:9
       where: { token },
     });
 
-    if (!tokenRecord) {
+    if (true) {
       return { valid: false };
     }
killedBy: TokenService validateEmailVerificationToken should validate valid email verification token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "email": "test@example.com",
-   "valid": true,

[Killed] BlockStatement
src/auth/token.service.ts:112:43
       return { valid: false };
     }
 
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.verificationToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
+    if (tokenRecord.expires < new Date()) {}
 
     return { valid: true, email: tokenRecord.identifier };
killedBy: TokenService validateEmailVerificationToken - expired token should return invalid and delete expired email verification token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "expired-email-verification-token"}}

Number of calls: 0

[Killed] BooleanLiteral
src/auth/token.service.ts:120:21
       return { valid: false };
     }
 
-    return { valid: true, email: tokenRecord.identifier };
+    return { valid: false, email: tokenRecord.identifier };
   }
 
killedBy: TokenService validateEmailVerificationToken should validate valid email verification token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "email": "test@example.com",
-   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:120:12
       return { valid: false };
     }
 
-    return { valid: true, email: tokenRecord.identifier };
+    return {};
   }
 
killedBy: TokenService validateEmailVerificationToken should validate valid email verification token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "email": "test@example.com",
-   "valid": true,

[Killed] BlockStatement
src/auth/token.service.ts:126:69
   /**
    * Consume un token de verificación de email (lo elimina)
    */
-  async consumeEmailVerificationToken(token: string): Promise<void> {
-    await this.prisma.verificationToken.delete({
-      where: { token },
-    });
-  }
+  async consumeEmailVerificationToken(token: string): Promise<void> {}
 
   /**
killedBy: TokenService consumeEmailVerificationToken should delete email verification token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "token-to-consume"}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:128:14
    */
   async consumeEmailVerificationToken(token: string): Promise<void> {
     await this.prisma.verificationToken.delete({
-      where: { token },
+      where: {},
     });
   }
killedBy: TokenService consumeEmailVerificationToken should delete email verification token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "token": "token-to-consume",

[Killed] BlockStatement
src/auth/token.service.ts:138:61
   /**
    * Crea un token de refresco
    */
-  async createRefreshToken(userId: string): Promise<string> {
-    const token = this.generateToken();
-    const expires = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000); // 7 días
-
-    await this.prisma.refreshToken.create({
-      data: {
-        userId,
-        token,
-        expires,
-      },
-    });
-
-    return token;
-  }
+  async createRefreshToken(userId: string): Promise<string> {}
 
   /**
killedBy: TokenService createRefreshToken should create a refresh token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"data": {"expires": Any<Date>, "token": "mock-token-123456789", "userId": "user-id-123"}}

Number of calls: 0

[Survived] ArithmeticOperator
src/auth/token.service.ts:140:43
    */
   async createRefreshToken(userId: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000); // 7 días
+    const expires = new Date(Date.now() + 7 / 24 * 60 * 60 * 1000); // 7 días
 
     await this.prisma.refreshToken.create({

[Survived] ArithmeticOperator
src/auth/token.service.ts:140:30
    */
   async createRefreshToken(userId: string): Promise<string> {
     const token = this.generateToken();
-    const expires = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000); // 7 días
+    const expires = new Date(Date.now() - 7 * 24 * 60 * 60 * 1000); // 7 días
 
     await this.prisma.refreshToken.create({

[Killed] BlockStatement
src/auth/token.service.ts:158:51
    */
   async validateRefreshToken(
     token: string,
-  ): Promise<{ valid: boolean; userId?: string }> {
-    const tokenRecord = await this.prisma.refreshToken.findUnique({
-      where: { token },
-    });
-
-    if (!tokenRecord) {
-      return { valid: false };
-    }
-
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.refreshToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
-
-    return { valid: true, userId: tokenRecord.userId };
-  }
+  ): Promise<{ valid: boolean; userId?: string }> {}
 
   /**
killedBy: TokenService validateRefreshToken should validate a valid refresh token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"userId": "user-id-123", "valid": true}
Received: undefined

[Killed] BlockStatement
src/auth/token.service.ts:167:43
       return { valid: false };
     }
 
-    if (tokenRecord.expires < new Date()) {
-      // Token expirado, eliminar
-      await this.prisma.refreshToken.delete({
-        where: { token },
-      });
-      return { valid: false };
-    }
+    if (tokenRecord.expires < new Date()) {}
 
     return { valid: true, userId: tokenRecord.userId };
killedBy: TokenService validateRefreshToken should return invalid and delete expired refresh token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "expired-refresh-token"}}

Number of calls: 0

[Killed] BooleanLiteral
src/auth/token.service.ts:175:21
       return { valid: false };
     }
 
-    return { valid: true, userId: tokenRecord.userId };
+    return { valid: false, userId: tokenRecord.userId };
   }
 
killedBy: TokenService validateRefreshToken should validate a valid refresh token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "userId": "user-id-123",
-   "valid": true,

[Killed] ObjectLiteral
src/auth/token.service.ts:175:12
       return { valid: false };
     }
 
-    return { valid: true, userId: tokenRecord.userId };
+    return {};
   }
 
killedBy: TokenService validateRefreshToken should validate a valid refresh token successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "userId": "user-id-123",
-   "valid": true,

[Killed] BlockStatement
src/auth/token.service.ts:181:59
   /**
    * Consume un token de refresco (lo elimina)
    */
-  async consumeRefreshToken(token: string): Promise<void> {
-    await this.prisma.refreshToken.delete({
-      where: { token },
-    });
-  }
+  async consumeRefreshToken(token: string): Promise<void> {}
 
   /**
killedBy: TokenService consumeRefreshToken should delete refresh token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "token-to-consume"}}

Number of calls: 0

[Killed] BlockStatement
src/auth/token.service.ts:190:41
   /**
    * Encuentra un token de refresco por su valor
    */
-  async findRefreshToken(token: string) {
-    return this.prisma.refreshToken.findUnique({
-      where: { token },
-    });
-  }
+  async findRefreshToken(token: string) {}
 
   /**
killedBy: TokenService findRefreshToken should find refresh token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"token": "test-refresh-token"}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:191:48
    * Encuentra un token de refresco por su valor
    */
   async findRefreshToken(token: string) {
-    return this.prisma.refreshToken.findUnique({
-      where: { token },
-    });
+    return this.prisma.refreshToken.findUnique({});
   }
 
killedBy: TokenService findRefreshToken should find refresh token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "token": "test-refresh-token",

[Killed] BlockStatement
src/auth/token.service.ts:200:69
    * Verifica si un usuario tiene refresh tokens válidos
    * Útil para validar si las sesiones del usuario han sido revocadas
    */
-  async userHasValidRefreshTokens(userId: string): Promise<boolean> {
-    const validTokenCount = await this.prisma.refreshToken.count({
-      where: {
-        userId,
-        expires: { gt: new Date() }, // Solo tokens no expirados
-      },
-    });
-
-    return validTokenCount > 0;
-  }
+  async userHasValidRefreshTokens(userId: string): Promise<boolean> {}
 
   /**
killedBy: TokenService userHasValidRefreshTokens should return true when user has valid refresh tokens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"expires": {"gt": Any<Date>}, "userId": "user-id-123"}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:202:14
    */
   async userHasValidRefreshTokens(userId: string): Promise<boolean> {
     const validTokenCount = await this.prisma.refreshToken.count({
-      where: {
-        userId,
-        expires: { gt: new Date() }, // Solo tokens no expirados
-      },
+      where: {},
     });
 
killedBy: TokenService userHasValidRefreshTokens should return true when user has valid refresh tokens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "expires": Object {

[Killed] ObjectLiteral
src/auth/token.service.ts:204:18
     const validTokenCount = await this.prisma.refreshToken.count({
       where: {
         userId,
-        expires: { gt: new Date() }, // Solo tokens no expirados
+        expires: {}, // Solo tokens no expirados
       },
     });
killedBy: TokenService userHasValidRefreshTokens should return true when user has valid refresh tokens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "expires": Object {

[Killed] ConditionalExpression
src/auth/token.service.ts:208:12
       },
     });
 
-    return validTokenCount > 0;
+    return true;
   }
 
killedBy: TokenService userHasValidRefreshTokens should return false when user has no valid refresh tokens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/auth/token.service.ts:208:12
       },
     });
 
-    return validTokenCount > 0;
+    return validTokenCount <= 0;
   }
 
killedBy: TokenService userHasValidRefreshTokens should return true when user has valid refresh tokens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/auth/token.service.ts:214:64
   /**
    * Revoca todas las sesiones de un usuario (elimina todos sus refresh tokens)
    */
-  async revokeAllUserSessions(userId: string): Promise<number> {
-    const result = await this.prisma.refreshToken.deleteMany({
-      where: { userId },
-    });
-
-    return result.count;
-  }
+  async revokeAllUserSessions(userId: string): Promise<number> {}
 
   /**
killedBy: TokenService revokeAllUserSessions should revoke all user sessions successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"userId": "user-id-123"}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:215:62
    * Revoca todas las sesiones de un usuario (elimina todos sus refresh tokens)
    */
   async revokeAllUserSessions(userId: string): Promise<number> {
-    const result = await this.prisma.refreshToken.deleteMany({
-      where: { userId },
-    });
+    const result = await this.prisma.refreshToken.deleteMany({});
 
     return result.count;
killedBy: TokenService revokeAllUserSessions should revoke all user sessions successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "userId": "user-id-123",

[Killed] BlockStatement
src/auth/token.service.ts:225:46
   /**
    * Revoca todas las sesiones de todos los usuarios (elimina todos los refresh tokens)
    */
-  async revokeAllSessions(): Promise<number> {
-    const result = await this.prisma.refreshToken.deleteMany({});
-    return result.count;
-  }
+  async revokeAllSessions(): Promise<number> {}
 
   /**
killedBy: TokenService revokeAllSessions should revoke all sessions successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0
