[Killed] BlockStatement
src/email/email.controller.ts:58:9
   async testEmail(@Body() testEmailDto: TestEmailDto) {
     const { to, type, userName = 'Usuario de Prueba' } = testEmailDto;
 
-    try {
-      this.logger.log(`Processing test email request: type=${type}, to=${to}`);
-
-      // ✅ OCP COMPLIANT: No switch statement needed!
-      // The registry dynamically finds the appropriate channel
-      const emailData = this.buildEmailData(type, to, userName);
-      const result = await this.emailChannelRegistry.sendEmail(type, emailData);
-
-      const response = {
-        success: result.success,
-        message: result.success
-          ? `Email de ${type} enviado exitosamente`
-          : `Error enviando email: ${result.error}`,
-        messageId: result.messageId,
-      };
-
-      this.logger.log(`Test email response: ${JSON.stringify(response)}`);
-      return response;
-    } catch (error: any) {
+    try {} catch (error: any) {
       this.logger.error(`Error processing test email request:`, error);
       return {
killedBy: EmailController testEmail should send welcome email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "welcome", {"loginUrl": "http://localhost:3000/login", "registrationDate": Any<String>, "supportUrl": "http://localhost:3000/support", "unsubscribeUrl": "http://localhost:3000/unsubscribe", "userEmail": "test@example.com", "userName": "Test User"}

Number of calls: 0

[Killed] BlockStatement
src/email/email.controller.ts:76:26
 
       this.logger.log(`Test email response: ${JSON.stringify(response)}`);
       return response;
-    } catch (error: any) {
-      this.logger.error(`Error processing test email request:`, error);
-      return {
-        success: false,
-        error: error.message,
-      };
-    }
+    } catch (error: any) {}
   }
 
killedBy: EmailController testEmail should return error for invalid email type
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"error": "Email type 'invalid' is not supported", "success": false}
Received: undefined

[Killed] ObjectLiteral
src/email/email.controller.ts:78:14
       return response;
     } catch (error: any) {
       this.logger.error(`Error processing test email request:`, error);
-      return {
-        success: false,
-        error: error.message,
-      };
+      return {};
     }
   }
killedBy: EmailController testEmail should return error for invalid email type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "error": "Email type 'invalid' is not supported",
-   "success": false,

[Killed] ObjectLiteral
src/email/email.controller.ts:93:22
    * no modification to the main flow.
    */
   private buildEmailData(type: string, to: string, userName: string): any {
-    const baseUrls = {
-      login: 'http://localhost:3000/login',
-      support: 'http://localhost:3000/support',
-      dashboard: 'http://localhost:3000/dashboard',
-      security: 'http://localhost:3000/security',
-      unsubscribe: 'http://localhost:3000/unsubscribe',
-    };
+    const baseUrls = {};
 
     switch (type) {
killedBy: EmailController testEmail should send welcome email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "welcome",
  Object {
-   "loginUrl": "http://localhost:3000/login",

[Killed] ConditionalExpression
src/email/email.controller.ts:102:7
     };
 
     switch (type) {
-      case 'welcome':
-        return {
-          userName,
-          userEmail: to,
-          registrationDate: new Date().toLocaleDateString('es-ES'),
-          loginUrl: baseUrls.login,
-          unsubscribeUrl: baseUrls.unsubscribe,
-          supportUrl: baseUrls.support,
-        };
+      case 'welcome':
 
       case 'reset':
killedBy: EmailController testEmail should send welcome email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "welcome",
  Object {
-   "loginUrl": "http://localhost:3000/login",

[Killed] ConditionalExpression
src/email/email.controller.ts:112:7
           supportUrl: baseUrls.support,
         };
 
-      case 'reset':
-        return {
-          userName,
-          userEmail: to,
-          resetUrl: 'http://localhost:3000/reset-password?token=test-token-123',
-          supportUrl: baseUrls.support,
-          securityUrl: baseUrls.security,
-        };
+      case 'reset':
 
       case 'verification':
killedBy: EmailController testEmail should send password reset email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "reset",
  Object {
-   "resetUrl": "http://localhost:3000/reset-password?token=test-token-123",

[Killed] StringLiteral
src/email/email.controller.ts:116:21
         return {
           userName,
           userEmail: to,
-          resetUrl: 'http://localhost:3000/reset-password?token=test-token-123',
+          resetUrl: "",
           supportUrl: baseUrls.support,
           securityUrl: baseUrls.security,
killedBy: EmailController testEmail should send password reset email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "reset",
  Object {
-   "resetUrl": "http://localhost:3000/reset-password?token=test-token-123",

[Killed] ConditionalExpression
src/email/email.controller.ts:121:7
           securityUrl: baseUrls.security,
         };
 
-      case 'verification':
-        return {
-          userName,
-          userEmail: to,
-          verificationUrl:
-            'http://localhost:3000/verify-email?token=test-token-123',
-          supportUrl: baseUrls.support,
-        };
+      case 'verification':
 
       case 'notification':
killedBy: EmailController testEmail should send verification email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "verification",
  Object {
+   "actionText": "Ir al Dashboard",

[Killed] ConditionalExpression
src/email/email.controller.ts:130:7
           supportUrl: baseUrls.support,
         };
 
-      case 'notification':
-        return {
-          userName,
-          userEmail: to,
-          subject: 'Notificación de Prueba',
-          message:
-            'Esta es una notificación de prueba del sistema de emails de Alkitu. Todo está funcionando correctamente.',
-          actionText: 'Ir al Dashboard',
-          actionUrl: baseUrls.dashboard,
-          supportUrl: baseUrls.support,
-        };
+      case 'notification':
 
       case 'marketing':
killedBy: EmailController testEmail should send notification email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "notification",
  Object {
-   "actionText": "Ir al Dashboard",

[Killed] StringLiteral
src/email/email.controller.ts:137:23
           subject: 'Notificación de Prueba',
           message:
             'Esta es una notificación de prueba del sistema de emails de Alkitu. Todo está funcionando correctamente.',
-          actionText: 'Ir al Dashboard',
+          actionText: "",
           actionUrl: baseUrls.dashboard,
           supportUrl: baseUrls.support,
killedBy: EmailController testEmail should send notification email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "notification",
@@ -1,7 +1,7 @@
  Object {

[Killed] ConditionalExpression
src/email/email.controller.ts:142:7
           supportUrl: baseUrls.support,
         };
 
-      case 'marketing':
-        return {
-          userName,
-          userEmail: to,
-          campaignName: 'Test Marketing Campaign',
-          contentHtml:
-            '<h1>Welcome to our newsletter!</h1><p>This is a test marketing email.</p>',
-          unsubscribeUrl: baseUrls.unsubscribe,
-          supportUrl: baseUrls.support,
-          trackingPixelUrl: 'http://localhost:3000/track',
-        };
+      case 'marketing':
 
       default:
killedBy: EmailController testEmail should send marketing email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ObjectLiteral
src/email/email.controller.ts:143:16
         };
 
       case 'marketing':
-        return {
-          userName,
-          userEmail: to,
-          campaignName: 'Test Marketing Campaign',
-          contentHtml:
-            '<h1>Welcome to our newsletter!</h1><p>This is a test marketing email.</p>',
-          unsubscribeUrl: baseUrls.unsubscribe,
-          supportUrl: baseUrls.support,
-          trackingPixelUrl: 'http://localhost:3000/track',
-        };
+        return {};
 
       default:
killedBy: EmailController testEmail should send marketing email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "marketing",
- Object {
-   "campaignName": "Test Marketing Campaign",

[Killed] StringLiteral
src/email/email.controller.ts:146:25
         return {
           userName,
           userEmail: to,
-          campaignName: 'Test Marketing Campaign',
+          campaignName: "",
           contentHtml:
             '<h1>Welcome to our newsletter!</h1><p>This is a test marketing email.</p>',
killedBy: EmailController testEmail should send marketing email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "marketing",
@@ -1,7 +1,7 @@
  Object {

[Killed] StringLiteral
src/email/email.controller.ts:148:13
           userEmail: to,
           campaignName: 'Test Marketing Campaign',
           contentHtml:
-            '<h1>Welcome to our newsletter!</h1><p>This is a test marketing email.</p>',
+            "",
           unsubscribeUrl: baseUrls.unsubscribe,
           supportUrl: baseUrls.support,
killedBy: EmailController testEmail should send marketing email test successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "marketing",
@@ -1,8 +1,8 @@
  Object {

[Killed] ConditionalExpression
src/email/email.controller.ts:154:7
           trackingPixelUrl: 'http://localhost:3000/track',
         };
 
-      default:
-        throw new Error(`Email type '${type}' is not supported`);
+      default:
     }
   }
killedBy: EmailController testEmail should return error for invalid email type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Email type 'invalid' is not supported",
+   "error": "Cannot read properties of undefined (reading 'success')",

[Killed] StringLiteral
src/email/email.controller.ts:155:25
         };
 
       default:
-        throw new Error(`Email type '${type}' is not supported`);
+        throw new Error(``);
     }
   }
killedBy: EmailController testEmail should return error for invalid email type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Email type 'invalid' is not supported",
+   "error": "",

[Killed] BlockStatement
src/email/email.controller.ts:186:29
       },
     },
   })
-  async testConfiguration() {
-    try {
-      const result = await this.emailService.testConfiguration();
-
-      return {
-        success: result.success,
-        message: result.success
-          ? 'Configuración de Resend funcionando correctamente'
-          : `Error en configuración: ${result.error}`,
-      };
-    } catch (error: any) {
-      return {
-        success: false,
-        error: error.message,
-      };
-    }
-  }
+  async testConfiguration() {}
 
   @Post('registry-info')
killedBy: EmailController testConfiguration should test configuration successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/email/email.controller.ts:187:9
     },
   })
   async testConfiguration() {
-    try {
-      const result = await this.emailService.testConfiguration();
-
-      return {
-        success: result.success,
-        message: result.success
-          ? 'Configuración de Resend funcionando correctamente'
-          : `Error en configuración: ${result.error}`,
-      };
-    } catch (error: any) {
+    try {} catch (error: any) {
       return {
         success: false,
killedBy: EmailController testConfiguration should test configuration successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/email/email.controller.ts:194:13
         success: result.success,
         message: result.success
           ? 'Configuración de Resend funcionando correctamente'
-          : `Error en configuración: ${result.error}`,
+          : ``,
       };
     } catch (error: any) {
killedBy: EmailController testConfiguration should handle configuration test errors
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Error en configuración: Configuration error",
+   "message": "",

[Killed] BlockStatement
src/email/email.controller.ts:196:26
           ? 'Configuración de Resend funcionando correctamente'
           : `Error en configuración: ${result.error}`,
       };
-    } catch (error: any) {
-      return {
-        success: false,
-        error: error.message,
-      };
-    }
+    } catch (error: any) {}
   }
 
killedBy: EmailController testConfiguration should handle unexpected configuration errors
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"error": "Network error", "success": false}
Received: undefined

[Killed] ObjectLiteral
src/email/email.controller.ts:197:14
           : `Error en configuración: ${result.error}`,
       };
     } catch (error: any) {
-      return {
-        success: false,
-        error: error.message,
-      };
+      return {};
     }
   }
killedBy: EmailController testConfiguration should handle unexpected configuration errors
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "error": "Network error",
-   "success": false,

[Killed] BooleanLiteral
src/email/email.controller.ts:246:18
       const stats = this.emailChannelRegistry.getRegistryStats();
 
       const response = {
-        success: true,
+        success: false,
         data: stats,
         message: 'Email registry information retrieved successfully',
killedBy: EmailController getRegistryInfo should return registry information successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -40,7 +40,7 @@
        "Each email type has its own validation and processing logic",
      ],

[Killed] StringLiteral
src/email/email.controller.ts:252:13
         ocpCompliance: {
           description: 'This system follows the Open/Closed Principle',
           benefits: [
-            'New email types can be added without modifying existing code',
+            "",
             'Email channels are registered dynamically',
             'System is extensible without breaking existing functionality',
killedBy: EmailController getRegistryInfo should return registry information successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -32,11 +32,11 @@
      "totalChannels": 5,
    },

[Killed] StringLiteral
src/email/email.controller.ts:258:13
             'Each email type has its own validation and processing logic',
           ],
           extensionExample:
-            'To add a new email type, create a class implementing IEmailChannel and register it in the module',
+            "",
         },
       };
killedBy: EmailController getRegistryInfo should return registry information successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -38,9 +38,9 @@
        "Email channels are registered dynamically",
        "System is extensible without breaking existing functionality",

[Survived] StringLiteral
src/email/email.controller.ts:262:23
         },
       };
 
-      this.logger.log(`Registry info response: ${JSON.stringify(response)}`);
+      this.logger.log(``);
       return response;
     } catch (error: any) {

[Killed] BlockStatement
src/email/email.controller.ts:264:26
 
       this.logger.log(`Registry info response: ${JSON.stringify(response)}`);
       return response;
-    } catch (error: any) {
-      this.logger.error('Error retrieving registry information:', error);
-      return {
-        success: false,
-        error: error.message,
-      };
-    }
+    } catch (error: any) {}
   }
 }
killedBy: EmailController getRegistryInfo should handle errors when retrieving registry information
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"error": "Registry error", "success": false}
Received: undefined

[Killed] ObjectLiteral
src/email/email.controller.ts:266:14
       return response;
     } catch (error: any) {
       this.logger.error('Error retrieving registry information:', error);
-      return {
-        success: false,
-        error: error.message,
-      };
+      return {};
     }
   }
killedBy: EmailController getRegistryInfo should handle errors when retrieving registry information
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "error": "Registry error",
-   "success": false,
