[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:55:51
     const hashedPassword = await this.userAuthentication.hashPassword(password);
 
     // Create user using repository service
-    const user = await this.userRepository.create({
-      ...userData,
-      password: hashedPassword,
-    });
+    const user = await this.userRepository.create({});
 
     // Get full user data for events
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill variable assignment mutations in destructuring
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "john@example.com",
-   "firstname": "John",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:62:19
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
-      // Publish user created event
-      await this.userEvents.publishUserCreated(fullUser);
-    }
+    if (fullUser) {}
 
     // Create welcome notification (optional, don't fail if it fails)
killedBy: UserFacadeService - Mutation Killer Tests Error Handling Mutation Killers should kill notification error recovery mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:62:9
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
+    if (false) {
       // Publish user created event
       await this.userEvents.publishUserCreated(fullUser);
killedBy: UserFacadeService - Mutation Killer Tests Error Handling Mutation Killers should kill notification error recovery mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/users/services/user-facade.service.ts:68:9
     }
 
     // Create welcome notification (optional, don't fail if it fails)
-    try {
-      await this.notificationService.createNotification({
-        userId: user.id,
-        message: `Welcome to Alkitu, ${user.firstname || user.email}!`,
-        type: NotificationType.INFO,
-        link: '/dashboard',
-      });
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"link": "/dashboard", "message": "Welcome to Alkitu, Test!", "type": "INFO", "userId": "test-user-id"}

Number of calls: 0

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:71:40
     try {
       await this.notificationService.createNotification({
         userId: user.id,
-        message: `Welcome to Alkitu, ${user.firstname || user.email}!`,
+        message: `Welcome to Alkitu, ${true}!`,
         type: NotificationType.INFO,
         link: '/dashboard',
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",

[Killed] LogicalOperator
src/users/services/user-facade.service.ts:71:40
     try {
       await this.notificationService.createNotification({
         userId: user.id,
-        message: `Welcome to Alkitu, ${user.firstname || user.email}!`,
+        message: `Welcome to Alkitu, ${user.firstname && user.email}!`,
         type: NotificationType.INFO,
         link: '/dashboard',
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill welcome message string mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "link": "/dashboard",
-   "message": "Welcome to Alkitu, Test!",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:75:21
         type: NotificationType.INFO,
         link: '/dashboard',
       });
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : 'Unknown error';
-      console.log(
-        'Warning: Could not create welcome notification:',
-        errorMessage,
-      );
-    }
+    } catch (error) {}
 
     return user;
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill instanceof vs typeof mutations in error handling
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Warning: Could not create welcome notification:", "Service down"

Number of calls: 0

[Survived] StringLiteral
src/users/services/user-facade.service.ts:77:50
       });
     } catch (error) {
       const errorMessage =
-        error instanceof Error ? error.message : 'Unknown error';
+        error instanceof Error ? error.message : "";
       console.log(
         'Warning: Could not create welcome notification:',

[Survived] BlockStatement
src/users/services/user-facade.service.ts:88:19
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async findAll() {
-    return this.userRepository.findAll();
-  }
+  async findAll() {}
 
   // ✅ SRP: Delegates to UserRepositoryService

[Killed] BlockStatement
src/users/services/user-facade.service.ts:93:55
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async findAllWithFilters(filterDto: FilterUsersDto) {
-    return this.userRepository.findAllWithFilters(filterDto);
-  }
+  async findAllWithFilters(filterDto: FilterUsersDto) {}
 
   // ✅ SRP: Delegates to UserRepositoryService
killedBy: UserFacadeService - Mutation Killer Tests Advanced Mutation Killers for 100% Coverage should kill loop mutations in user search operations
statusReason: TypeError: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/users/services/user-facade.service.ts:98:29
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async findOne(id: string) {
-    return this.userRepository.findById(id);
-  }
+  async findOne(id: string) {}
 
   // ✅ SRP: Delegates to UserRepositoryService
killedBy: UserFacadeService - Mutation Killer Tests Error Handling Mutation Killers should kill error handling branch mutations
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] BlockStatement
src/users/services/user-facade.service.ts:103:36
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async findByEmail(email: string) {
-    return this.userRepository.findByEmail(email);
-  }
+  async findByEmail(email: string) {}
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:113:9
     const previousUser = await this.userRepository.findById(id);
 
     // Check if user exists
-    if (!previousUser) {
+    if (previousUser) {
       throw new Error('User not found');
     }
killedBy: UserFacadeService - Mutation Killer Tests Error Handling Mutation Killers should kill error handling branch mutations
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: Error

Received message: "User not found"

      192 |         } else {

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:113:9
     const previousUser = await this.userRepository.findById(id);
 
     // Check if user exists
-    if (!previousUser) {
+    if (true) {
       throw new Error('User not found');
     }
killedBy: UserFacadeService - Mutation Killer Tests Error Handling Mutation Killers should kill error handling branch mutations
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: Error

Received message: "User not found"

      192 |         } else {

[Survived] ConditionalExpression
src/users/services/user-facade.service.ts:122:9
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(updatedUser.email);
-    if (fullUser && previousUser) {
+    if (true) {
       // Publish user updated event - convert UserResponse to User for events
       await this.userEvents.publishUserUpdated(fullUser, {

[Survived] ConditionalExpression
src/users/services/user-facade.service.ts:122:9
 
     // Get full user data for events
     const fullUser = await this.userRepository.findByEmail(updatedUser.email);
-    if (fullUser && previousUser) {
+    if (false) {
       // Publish user updated event - convert UserResponse to User for events
       await this.userEvents.publishUserUpdated(fullUser, {

[Survived] BlockStatement
src/users/services/user-facade.service.ts:137:70
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async updateTags(id: string, updateUserTagsDto: UpdateUserTagsDto) {
-    return this.userRepository.updateTags(id, updateUserTagsDto);
-  }
+  async updateTags(id: string, updateUserTagsDto: UpdateUserTagsDto) {}
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService

[Killed] BlockStatement
src/users/services/user-facade.service.ts:142:28
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async remove(id: string) {
-    // Get user data before deletion for events
-    const user = await this.userRepository.findById(id);
-
-    // Check if user exists
-    if (!user) {
-      throw new Error('User not found');
-    }
-
-    // Delete user
-    await this.userRepository.delete(id);
-
-    // Publish user deleted event
-    await this.userEvents.publishUserDeleted(id, {
-      id: user.id,
-      email: user.email,
-      firstname: user.firstname,
-      lastname: user.lastname,
-      phone: user.phone,
-    });
-
-    // Return success message for backward compatibility
-    return { message: 'User deleted successfully' };
-  }
+  async remove(id: string) {}
 
   // ✅ SRP: Delegates to UserAuthenticationService + UserEventsService
killedBy: UserFacadeService Simple Tests remove should throw error when user not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:147:9
     const user = await this.userRepository.findById(id);
 
     // Check if user exists
-    if (!user) {
+    if (false) {
       throw new Error('User not found');
     }
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill user existence conditionals
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "User not found"
Received message:   "Cannot read properties of null (reading 'id')"

      254 |       // Publish user deleted event
      255 |       await this.userEvents.publishUserDeleted(id, stryMutAct_9fa48("252") ? {} : (stryCov_9fa48("252"), {
    > 256 |         id: user.id,

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:147:9
     const user = await this.userRepository.findById(id);
 
     // Check if user exists
-    if (!user) {
+    if (user) {
       throw new Error('User not found');
     }
killedBy: UserFacadeService Simple Tests remove should throw error when user not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "User not found"
Received message:   "Cannot read properties of null (reading 'id')"

      254 |       // Publish user deleted event
      255 |       await this.userEvents.publishUserDeleted(id, stryMutAct_9fa48("252") ? {} : (stryCov_9fa48("252"), {
    > 256 |         id: user.id,

[Survived] ObjectLiteral
src/users/services/user-facade.service.ts:155:50
     await this.userRepository.delete(id);
 
     // Publish user deleted event
-    await this.userEvents.publishUserDeleted(id, {
-      id: user.id,
-      email: user.email,
-      firstname: user.firstname,
-      lastname: user.lastname,
-      phone: user.phone,
-    });
+    await this.userEvents.publishUserDeleted(id, {});
 
     // Return success message for backward compatibility

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:164:12
     });
 
     // Return success message for backward compatibility
-    return { message: 'User deleted successfully' };
+    return {};
   }
 
killedBy: UserFacadeService - Mutation Killer Tests String Literal Mutation Killers should kill success message string mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User deleted successfully"
Received: undefined

[Killed] BlockStatement
src/users/services/user-facade.service.ts:168:46
   }
 
   // ✅ SRP: Delegates to UserAuthenticationService + UserEventsService
-  async validateUser(loginDto: LoginUserDto) {
-    const authenticatedUser =
-      await this.userAuthentication.validateUser(loginDto);
-
-    if (authenticatedUser) {
-      // Publish login event
-      await this.userEvents.publishUserLoggedIn(authenticatedUser.id);
-    }
-
-    return authenticatedUser;
-  }
+  async validateUser(loginDto: LoginUserDto) {}
 
   // ✅ SRP: Delegates to UserRepositoryService
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill authentication conditional mutations
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:172:9
     const authenticatedUser =
       await this.userAuthentication.validateUser(loginDto);
 
-    if (authenticatedUser) {
+    if (false) {
       // Publish login event
       await this.userEvents.publishUserLoggedIn(authenticatedUser.id);
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill authentication conditional mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-user-id"

Number of calls: 0

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:172:9
     const authenticatedUser =
       await this.userAuthentication.validateUser(loginDto);
 
-    if (authenticatedUser) {
+    if (true) {
       // Publish login event
       await this.userEvents.publishUserLoggedIn(authenticatedUser.id);
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill authentication conditional mutations
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Survived] BlockStatement
src/users/services/user-facade.service.ts:181:60
   }
 
   // ✅ SRP: Delegates to UserRepositoryService
-  async updatePassword(id: string, hashedPassword: string) {
-    return this.userRepository.updatePassword(id, hashedPassword);
-  }
+  async updatePassword(id: string, hashedPassword: string) {}
 
   // ✅ SRP: Delegates to UserAuthenticationService + UserEventsService

[Killed] BlockStatement
src/users/services/user-facade.service.ts:186:74
   }
 
   // ✅ SRP: Delegates to UserAuthenticationService + UserEventsService
-  async changePassword(id: string, changePasswordDto: ChangePasswordDto) {
-    await this.userAuthentication.changePassword(id, changePasswordDto);
-
-    // Publish password changed event
-    await this.userEvents.publishUserPasswordChanged(id);
-
-    return { message: 'Password changed successfully' };
-  }
+  async changePassword(id: string, changePasswordDto: ChangePasswordDto) {}
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
killedBy: UserFacadeService Simple Tests changePassword should change password successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Password changed successfully"}
Received: undefined

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:192:12
     // Publish password changed event
     await this.userEvents.publishUserPasswordChanged(id);
 
-    return { message: 'Password changed successfully' };
+    return {};
   }
 
killedBy: UserFacadeService Simple Tests changePassword should change password successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "message": "Password changed successfully",
- }

[Survived] BlockStatement
src/users/services/user-facade.service.ts:196:41
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async markEmailAsVerified(id: string) {
-    const result = await this.userRepository.markEmailAsVerified(id);
-
-    // Publish email verified event
-    await this.userEvents.publishUserEmailVerified(id);
-
-    return result;
-  }
+  async markEmailAsVerified(id: string) {}
 
   // ✅ SRP: Delegates to UserAnalyticsService

[Survived] BlockStatement
src/users/services/user-facade.service.ts:206:24
   }
 
   // ✅ SRP: Delegates to UserAnalyticsService
-  async getUserStats() {
-    return this.userAnalytics.getUserStats();
-  }
+  async getUserStats() {}
 
   // ✅ SRP: Delegates to UserAuthenticationService

[Survived] BlockStatement
src/users/services/user-facade.service.ts:211:66
   }
 
   // ✅ SRP: Delegates to UserAuthenticationService
-  async adminChangePassword(userId: string, newPassword: string) {
-    const hashedPassword =
-      await this.userAuthentication.hashPassword(newPassword);
-    await this.userRepository.updatePassword(userId, hashedPassword);
-
-    // Publish password changed event
-    await this.userEvents.publishUserPasswordChanged(userId);
-  }
+  async adminChangePassword(userId: string, newPassword: string) {}
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService

[Survived] BlockStatement
src/users/services/user-facade.service.ts:221:39
   }
 
   // ✅ SRP: Delegates to UserRepositoryService + UserEventsService
-  async anonymizeUser(userId: string) {
-    const anonymizedData = {
-      firstname: 'Anonymous',
-      lastname: 'User',
-      email: `anonymous_${userId}@example.com`,
-      phone: undefined, // Use undefined instead of null for UpdateUserDto
-    };
-
-    const user = await this.userRepository.update(userId, anonymizedData);
-
-    // Publish user updated event
-    const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
-      await this.userEvents.publishUserUpdated(fullUser, { id: userId });
-    }
-
-    return {
-      success: true,
-      userId,
-      anonymizedFields: Object.keys(anonymizedData),
-      retainedFields: ['id', 'role', 'createdAt'],
-      timestamp: new Date(),
-    };
-  }
+  async anonymizeUser(userId: string) {}
 
   // ✅ SRP: Delegates to NotificationService

[Survived] ConditionalExpression
src/users/services/user-facade.service.ts:233:9
 
     // Publish user updated event
     const fullUser = await this.userRepository.findByEmail(user.email);
-    if (fullUser) {
+    if (true) {
       await this.userEvents.publishUserUpdated(fullUser, { id: userId });
     }

[Survived] ObjectLiteral
src/users/services/user-facade.service.ts:234:58
     // Publish user updated event
     const fullUser = await this.userRepository.findByEmail(user.email);
     if (fullUser) {
-      await this.userEvents.publishUserUpdated(fullUser, { id: userId });
+      await this.userEvents.publishUserUpdated(fullUser, {});
     }
 

[Survived] StringLiteral
src/users/services/user-facade.service.ts:241:24
       success: true,
       userId,
       anonymizedFields: Object.keys(anonymizedData),
-      retainedFields: ['id', 'role', 'createdAt'],
+      retainedFields: ["", 'role', 'createdAt'],
       timestamp: new Date(),
     };

[Killed] BlockStatement
src/users/services/user-facade.service.ts:247:60
   }
 
   // ✅ SRP: Delegates to NotificationService
-  async sendMessageToUser(userId: string, message: string) {
-    try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: NotificationType.INFO,
-      });
-      return { success: true, message: 'Message sent successfully' };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : 'Unknown error';
-      return {
-        success: false,
-        message: `Failed to send message: ${errorMessage}`,
-      };
-    }
-  }
+  async sendMessageToUser(userId: string, message: string) {}
 
   // ✅ SRP: Delegates to UserAuthenticationService
killedBy: UserFacadeService Simple Tests sendMessageToUser should send message successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Message sent successfully", "success": true}
Received: undefined

[Killed] BlockStatement
src/users/services/user-facade.service.ts:248:9
 
   // ✅ SRP: Delegates to NotificationService
   async sendMessageToUser(userId: string, message: string) {
-    try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: NotificationType.INFO,
-      });
-      return { success: true, message: 'Message sent successfully' };
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
killedBy: UserFacadeService Simple Tests sendMessageToUser should send message successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Message sent successfully", "success": true}
Received: undefined

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:249:57
   // ✅ SRP: Delegates to NotificationService
   async sendMessageToUser(userId: string, message: string) {
     try {
-      await this.notificationService.createNotification({
-        userId,
-        message,
-        type: NotificationType.INFO,
-      });
+      await this.notificationService.createNotification({});
       return { success: true, message: 'Message sent successfully' };
     } catch (error) {
killedBy: UserFacadeService Simple Tests sendMessageToUser should send message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Test message",
-   "type": "INFO",

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:254:25
         message,
         type: NotificationType.INFO,
       });
-      return { success: true, message: 'Message sent successfully' };
+      return { success: false, message: 'Message sent successfully' };
     } catch (error) {
       const errorMessage =
killedBy: UserFacadeService - Mutation Killer Tests Logical Operator Mutation Killers should kill short-circuit evaluation mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:254:14
         message,
         type: NotificationType.INFO,
       });
-      return { success: true, message: 'Message sent successfully' };
+      return {};
     } catch (error) {
       const errorMessage =
killedBy: UserFacadeService Simple Tests sendMessageToUser should send message successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "message": "Message sent successfully",
-   "success": true,

[Killed] BlockStatement
src/users/services/user-facade.service.ts:255:21
         type: NotificationType.INFO,
       });
       return { success: true, message: 'Message sent successfully' };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : 'Unknown error';
-      return {
-        success: false,
-        message: `Failed to send message: ${errorMessage}`,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: UserFacadeService - Mutation Killer Tests Logical Operator Mutation Killers should kill short-circuit evaluation mutations
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:258:14
     } catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : 'Unknown error';
-      return {
-        success: false,
-        message: `Failed to send message: ${errorMessage}`,
-      };
+      return {};
     }
   }
killedBy: UserFacadeService - Mutation Killer Tests Logical Operator Mutation Killers should kill short-circuit evaluation mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] StringLiteral
src/users/services/user-facade.service.ts:260:18
         error instanceof Error ? error.message : 'Unknown error';
       return {
         success: false,
-        message: `Failed to send message: ${errorMessage}`,
+        message: ``,
       };
     }
killedBy: UserFacadeService - Mutation Killer Tests Logical Operator Mutation Killers should kill short-circuit evaluation mutations
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Failed to send message"
Received string:    ""

[Killed] BlockStatement
src/users/services/user-facade.service.ts:266:73
   }
 
   // ✅ SRP: Delegates to UserAuthenticationService
-  async createImpersonationToken(adminId: string, targetUserId: string) {
-    // Simplified implementation - in production, use proper JWT
-    const token =
-      await this.userAuthentication.generatePasswordResetToken(targetUserId);
-
-    return {
-      token,
-      expiresAt: new Date(Date.now() + 3600000), // 1 hour
-      targetUserId,
-      adminId,
-      restrictions: ['read-only', 'no-admin-actions'],
-    };
-  }
+  async createImpersonationToken(adminId: string, targetUserId: string) {}
 
   // Bulk operations - these would be implemented by separate bulk services
killedBy: UserFacadeService Simple Tests createImpersonationToken should create impersonation token
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"adminId": "admin-id", "expiresAt": Any<Date>, "restrictions": ["read-only", "no-admin-actions"], "targetUserId": "target-id", "token": "generated-token"}
Received: undefined

[Killed] ArithmeticOperator
src/users/services/user-facade.service.ts:273:27
 
     return {
       token,
-      expiresAt: new Date(Date.now() + 3600000), // 1 hour
+      expiresAt: new Date(Date.now() - 3600000), // 1 hour
       targetUserId,
       adminId,
killedBy: UserFacadeService - Mutation Killer Tests Date Arithmetic Mutation Killers should kill date addition/subtraction mutations
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1766787540688
Received:   1766780350688

[Killed] StringLiteral
src/users/services/user-facade.service.ts:276:22
       expiresAt: new Date(Date.now() + 3600000), // 1 hour
       targetUserId,
       adminId,
-      restrictions: ['read-only', 'no-admin-actions'],
+      restrictions: ["", 'no-admin-actions'],
     };
   }
killedBy: UserFacadeService Simple Tests createImpersonationToken should create impersonation token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "adminId": "admin-id",
    "expiresAt": Any<Date>,

[Killed] BlockStatement
src/users/services/user-facade.service.ts:283:60
   // Bulk operations - these would be implemented by separate bulk services
   // For now, we'll provide simplified implementations
 
-  async bulkDeleteUsers(bulkDeleteDto: BulkDeleteUsersDto) {
-    const { userIds } = bulkDeleteDto;
-    let deletedCount = 0;
-
-    for (const userId of userIds) {
-      try {
-        await this.remove(userId);
-        deletedCount++;
-      } catch (error) {
-        console.error(`Failed to delete user ${userId}:`, error);
-      }
-    }
-
-    // Publish bulk operation event
-    await this.userEvents.publishUserBulkOperation('bulk_delete', userIds, {
-      requestedCount: userIds.length,
-      successCount: deletedCount,
-    });
-
-    return {
-      success: true,
-      message: `Successfully deleted ${deletedCount} out of ${userIds.length} users`,
-      affectedCount: deletedCount,
-    };
-  }
+  async bulkDeleteUsers(bulkDeleteDto: BulkDeleteUsersDto) {}
 
   async bulkUpdateRole(bulkUpdateRoleDto: BulkUpdateRoleDto) {
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should delete multiple users
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"affectedCount": 3, "message": "Successfully deleted 3 out of 3 users", "success": true}
Received: undefined

[Killed] BlockStatement
src/users/services/user-facade.service.ts:287:35
     const { userIds } = bulkDeleteDto;
     let deletedCount = 0;
 
-    for (const userId of userIds) {
-      try {
-        await this.remove(userId);
-        deletedCount++;
-      } catch (error) {
-        console.error(`Failed to delete user ${userId}:`, error);
-      }
-    }
+    for (const userId of userIds) {}
 
     // Publish bulk operation event
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should delete multiple users
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "affectedCount": 3,
-   "message": "Successfully deleted 3 out of 3 users",
