[Killed] BlockStatement
src/auth/token.service.ts:237:6
     passwordResetTokens: number;
     verificationTokens: number;
     refreshTokens: number;
-  }> {
-    const now = new Date();
-
-    const [passwordResetCount, verificationCount, refreshCount] =
-      await Promise.all([
-        this.prisma.passwordResetToken.deleteMany({
-          where: { expires: { lt: now } },
-        }),
-        this.prisma.verificationToken.deleteMany({
-          where: { expires: { lt: now } },
-        }),
-        this.prisma.refreshToken.deleteMany({
-          where: { expires: { lt: now } },
-        }),
-      ]);
-
-    return {
-      passwordResetTokens: passwordResetCount.count,
-      verificationTokens: verificationCount.count,
-      refreshTokens: refreshCount.count,
-    };
-  }
+  }> {}
 }
 
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"expires": {"lt": Any<Date>}}}

Number of calls: 0

[Killed] ObjectLiteral
src/auth/token.service.ts:243:29
     const [passwordResetCount, verificationCount, refreshCount] =
       await Promise.all([
         this.prisma.passwordResetToken.deleteMany({
-          where: { expires: { lt: now } },
+          where: { expires: {} },
         }),
         this.prisma.verificationToken.deleteMany({
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "expires": Object {

[Killed] ObjectLiteral
src/auth/token.service.ts:245:50
         this.prisma.passwordResetToken.deleteMany({
           where: { expires: { lt: now } },
         }),
-        this.prisma.verificationToken.deleteMany({
-          where: { expires: { lt: now } },
-        }),
+        this.prisma.verificationToken.deleteMany({}),
         this.prisma.refreshToken.deleteMany({
           where: { expires: { lt: now } },
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "expires": Object {

[Killed] ObjectLiteral
src/auth/token.service.ts:246:29
           where: { expires: { lt: now } },
         }),
         this.prisma.verificationToken.deleteMany({
-          where: { expires: { lt: now } },
+          where: { expires: {} },
         }),
         this.prisma.refreshToken.deleteMany({
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "expires": Object {

[Killed] ObjectLiteral
src/auth/token.service.ts:246:18
           where: { expires: { lt: now } },
         }),
         this.prisma.verificationToken.deleteMany({
-          where: { expires: { lt: now } },
+          where: {},
         }),
         this.prisma.refreshToken.deleteMany({
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "expires": Object {

[Killed] ObjectLiteral
src/auth/token.service.ts:248:45
         this.prisma.verificationToken.deleteMany({
           where: { expires: { lt: now } },
         }),
-        this.prisma.refreshToken.deleteMany({
-          where: { expires: { lt: now } },
-        }),
+        this.prisma.refreshToken.deleteMany({}),
       ]);
 
killedBy: TokenService cleanExpiredTokens should clean expired tokens successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "expires": Object {
