[Killed] BlockStatement
src/users/services/user-facade.service.ts:288:11
     let deletedCount = 0;
 
     for (const userId of userIds) {
-      try {
-        await this.remove(userId);
-        deletedCount++;
-      } catch (error) {
+      try {} catch (error) {
         console.error(`Failed to delete user ${userId}:`, error);
       }
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should delete multiple users
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "affectedCount": 3,
-   "message": "Successfully deleted 3 out of 3 users",

[Killed] UpdateOperator
src/users/services/user-facade.service.ts:290:9
     for (const userId of userIds) {
       try {
         await this.remove(userId);
-        deletedCount++;
+        deletedCount--;
       } catch (error) {
         console.error(`Failed to delete user ${userId}:`, error);
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should delete multiple users
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "affectedCount": 3,
-   "message": "Successfully deleted 3 out of 3 users",

[Killed] BlockStatement
src/users/services/user-facade.service.ts:291:23
       try {
         await this.remove(userId);
         deletedCount++;
-      } catch (error) {
-        console.error(`Failed to delete user ${userId}:`, error);
-      }
+      } catch (error) {}
     }
 
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should handle partial failures in bulk delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to delete user user2:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
src/users/services/user-facade.service.ts:292:23
         await this.remove(userId);
         deletedCount++;
       } catch (error) {
-        console.error(`Failed to delete user ${userId}:`, error);
+        console.error(``, error);
       }
     }
killedBy: UserFacadeService Simple Tests bulkDeleteUsers should handle partial failures in bulk delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to delete user user2:", Any<Error>
Received: "", [Error: Delete failed]

Number of calls: 1

[Killed] BlockStatement
src/users/services/user-facade.service.ts:313:35
     const { userIds, role } = bulkUpdateRoleDto;
     let updatedCount = 0;
 
-    for (const userId of userIds) {
-      try {
-        await this.update(userId, { role });
-        updatedCount++;
-      } catch (error) {
-        console.error(`Failed to update role for user ${userId}:`, error);
-      }
-    }
+    for (const userId of userIds) {}
 
     // Publish bulk operation event
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill Array.length mutations in bulk operations
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "3 out of 3 users"
Received string:    "Successfully updated role for 0 out of 3 users"

[Killed] BlockStatement
src/users/services/user-facade.service.ts:314:11
     let updatedCount = 0;
 
     for (const userId of userIds) {
-      try {
-        await this.update(userId, { role });
-        updatedCount++;
-      } catch (error) {
+      try {} catch (error) {
         console.error(`Failed to update role for user ${userId}:`, error);
       }
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill Array.length mutations in bulk operations
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "3 out of 3 users"
Received string:    "Successfully updated role for 0 out of 3 users"

[Survived] ObjectLiteral
src/users/services/user-facade.service.ts:315:35
 
     for (const userId of userIds) {
       try {
-        await this.update(userId, { role });
+        await this.update(userId, {});
         updatedCount++;
       } catch (error) {

[Killed] UpdateOperator
src/users/services/user-facade.service.ts:316:9
     for (const userId of userIds) {
       try {
         await this.update(userId, { role });
-        updatedCount++;
+        updatedCount--;
       } catch (error) {
         console.error(`Failed to update role for user ${userId}:`, error);
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill Array.length mutations in bulk operations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "bulk_update_role",
  ["u1", "u2", "u3"],
- ObjectContaining {"requestedCount": 3, "successCount": 3},

[Killed] BlockStatement
src/users/services/user-facade.service.ts:317:23
       try {
         await this.update(userId, { role });
         updatedCount++;
-      } catch (error) {
-        console.error(`Failed to update role for user ${userId}:`, error);
-      }
+      } catch (error) {}
     }
 
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill console.error vs console.log mutations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to update role for user u2:", Any<Error>

Number of calls: 0

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:326:7
     await this.userEvents.publishUserBulkOperation(
       'bulk_update_role',
       userIds,
-      {
-        newRole: role,
-        requestedCount: userIds.length,
-        successCount: updatedCount,
-      },
+      {},
     );
 
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill Array.length mutations in bulk operations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "bulk_update_role",
  ["u1", "u2", "u3"],
- ObjectContaining {"requestedCount": 3, "successCount": 3},

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:333:12
       },
     );
 
-    return {
-      success: true,
-      message: `Successfully updated role for ${updatedCount} out of ${userIds.length} users`,
-      affectedCount: updatedCount,
-    };
+    return {};
   }
 
killedBy: UserFacadeService - Mutation Killer Tests Boundary Condition Mutation Killers should kill empty array boundary mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] StringLiteral
src/users/services/user-facade.service.ts:335:16
 
     return {
       success: true,
-      message: `Successfully updated role for ${updatedCount} out of ${userIds.length} users`,
+      message: ``,
       affectedCount: updatedCount,
     };
killedBy: UserFacadeService - Mutation Killer Tests Boundary Condition Mutation Killers should kill empty array boundary mutations
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "0 out of 0"
Received string:    ""

[Survived] BlockStatement
src/users/services/user-facade.service.ts:344:35
     const { userIds, status } = bulkUpdateStatusDto;
     let updatedCount = 0;
 
-    for (const userId of userIds) {
-      try {
-        await this.update(userId, { status });
-        updatedCount++;
-      } catch (error) {
-        console.error(`Failed to update status for user ${userId}:`, error);
-      }
-    }
+    for (const userId of userIds) {}
 
     // Publish bulk operation event

[Survived] BlockStatement
src/users/services/user-facade.service.ts:345:11
     let updatedCount = 0;
 
     for (const userId of userIds) {
-      try {
-        await this.update(userId, { status });
-        updatedCount++;
-      } catch (error) {
+      try {} catch (error) {
         console.error(`Failed to update status for user ${userId}:`, error);
       }

[Survived] ObjectLiteral
src/users/services/user-facade.service.ts:346:35
 
     for (const userId of userIds) {
       try {
-        await this.update(userId, { status });
+        await this.update(userId, {});
         updatedCount++;
       } catch (error) {

[Survived] UpdateOperator
src/users/services/user-facade.service.ts:347:9
     for (const userId of userIds) {
       try {
         await this.update(userId, { status });
-        updatedCount++;
+        updatedCount--;
       } catch (error) {
         console.error(`Failed to update status for user ${userId}:`, error);

[Survived] BlockStatement
src/users/services/user-facade.service.ts:348:23
       try {
         await this.update(userId, { status });
         updatedCount++;
-      } catch (error) {
-        console.error(`Failed to update status for user ${userId}:`, error);
-      }
+      } catch (error) {}
     }
 

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:372:33
   }
 
   async resetUserPassword(resetPasswordDto: AdminResetPasswordDto) {
-    const { userId, sendEmail = true } = resetPasswordDto;
+    const { userId, sendEmail = false } = resetPasswordDto;
 
     // Generate temporary password
killedBy: UserFacadeService - Mutation Killer Tests Hardcore Mutation Killers for 100% Coverage should kill default parameter mutations in optional fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UnaryOperator
src/users/services/user-facade.service.ts:375:59
     const { userId, sendEmail = true } = resetPasswordDto;
 
     // Generate temporary password
-    const tempPassword = Math.random().toString(36).slice(-8);
+    const tempPassword = Math.random().toString(36).slice(+8);
 
     // Hash and update password
killedBy: UserFacadeService - Mutation Killer Tests Boundary Condition Mutation Killers should kill Math.random boundary mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 6

[Killed] MethodExpression
src/users/services/user-facade.service.ts:375:26
     const { userId, sendEmail = true } = resetPasswordDto;
 
     // Generate temporary password
-    const tempPassword = Math.random().toString(36).slice(-8);
+    const tempPassword = Math.random().toString(36);
 
     // Hash and update password
killedBy: UserFacadeService - Mutation Killer Tests Boundary Condition Mutation Killers should kill Math.random boundary mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 13

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:385:21
     // Publish password changed event
     await this.userEvents.publishUserPasswordChanged(userId);
 
-    let emailSent = false;
+    let emailSent = true;
     if (sendEmail) {
       try {
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/users/services/user-facade.service.ts:386:20
     await this.userEvents.publishUserPasswordChanged(userId);
 
     let emailSent = false;
-    if (sendEmail) {
-      try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: NotificationType.WARNING,
-        });
-        emailSent = true;
-      } catch (error) {
-        console.error('Failed to send password reset email:', error);
-      }
-    }
+    if (sendEmail) {}
 
     return {
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/users/services/user-facade.service.ts:386:9
     await this.userEvents.publishUserPasswordChanged(userId);
 
     let emailSent = false;
-    if (sendEmail) {
+    if (true) {
       try {
         await this.notificationService.createNotification({
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/users/services/user-facade.service.ts:387:11
 
     let emailSent = false;
     if (sendEmail) {
-      try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: NotificationType.WARNING,
-        });
-        emailSent = true;
-      } catch (error) {
+      try {} catch (error) {
         console.error('Failed to send password reset email:', error);
       }
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ObjectLiteral
src/users/services/user-facade.service.ts:388:59
     let emailSent = false;
     if (sendEmail) {
       try {
-        await this.notificationService.createNotification({
-          userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
-          type: NotificationType.WARNING,
-        });
+        await this.notificationService.createNotification({});
         emailSent = true;
       } catch (error) {

[Survived] StringLiteral
src/users/services/user-facade.service.ts:390:20
       try {
         await this.notificationService.createNotification({
           userId,
-          message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
+          message: ``,
           type: NotificationType.WARNING,
         });

[Killed] BooleanLiteral
src/users/services/user-facade.service.ts:393:21
           message: `Your password has been reset. Your temporary password is: ${tempPassword}`,
           type: NotificationType.WARNING,
         });
-        emailSent = true;
+        emailSent = false;
       } catch (error) {
         console.error('Failed to send password reset email:', error);
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/users/services/user-facade.service.ts:394:23
           type: NotificationType.WARNING,
         });
         emailSent = true;
-      } catch (error) {
-        console.error('Failed to send password reset email:', error);
-      }
+      } catch (error) {}
     }
 

[Killed] ObjectLiteral
src/users/services/user-facade.service.ts:399:12
       }
     }
 
-    return {
-      success: true,
-      message: emailSent
-        ? 'Password reset email sent'
-        : 'Password reset completed',
-      tempPassword: emailSent ? undefined : tempPassword,
-      emailSent,
-    };
+    return {};
   }
 }
killedBy: UserFacadeService - Mutation Killer Tests Conditional Expression Mutation Killers should kill email sending conditional mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
